import streamlit as st

def etc():
    st.title("ETC销售")

    # ===============
    # 概述
    # ===============
    st.header("♟ 概述 ♟")
    st.markdown("ETC销售，是一个简单的机器人ETC销售场景")

    # ===============
    # 样例体验
    # ===============
    st.header("♟ 样例体验 ♟")
    st.warning("体验环境为测试环境，仅支持样例解析，暂不开放自定义输入")

    if st.checkbox("🍄 点击查看样例对话 1"):
        st.markdown("|Bot|User|\n"
                    "|---|---|\n"
                    "|轻松出行，畅通无忧。<br>新型推出ETC轻松办理便民服务，您是否有办理需求</br>||\n"
                    "||什么是ETC|\n"
                    "|您好，ETC指的是电子不停车收费系统。<br>是在通过收费站时通过车上安装的ETC车载系统与收费站质检微波通讯，</br>进行车辆识别，再联合网络和银行进行自动扣费的一种新型收费模式||\n"
                    "||查一下路况|\n"
                    "|您好，请问您查询的是那条道路，如五常大道||\n"
                    "||五常大道|\n"
                    "|当前五常大道的路况为轻微拥堵请问您什么其他要求<br>例如办理ETC，查询路况等</br>||\n"
                    "||ETC有什么用|\n"
                    "|您好，ETC的优点在于可以为您节省收费站的排队时间，节省费用<br>车辆减少起步、刹车频率，降低磨损、油耗、绿色低碳，</br>车辆通行收费站不停车，可降低噪声和尾气排放，减少污染||\n"
                    "||没有了|\n"
                    "|感谢您的来电，祝您生活愉快，<br>接下来请对本次服务做出评价，非常满意请按1，满意请按2，不满意请按3</br>||", unsafe_allow_html=True)

    if st.checkbox("🍄 点击查看样例对话 2"):
        st.markdown("|Bot|User|\n"
                    "|---|---|\n"
                    "|轻松出行，畅通无忧。<br>新型推出ETC轻松办理便民服务，您是否有办理需求</br>||\n"
                    "||查一下违规记录|\n"
                    "|请问您查询的日期是什么时候，您可以说2020年1月||\n"
                    "||2020年1月|\n"
                    "|查询到您共有1处罚记录请问您什么其他要求，<br>例如办理ETC，查询路况等</br>||\n"
                    "||我想办理ETC|\n"
                    "|您好，你可前往营业大厅，<br>或者拨打02596777进行在线办理请问您什么其他要求，<br>例如办理ETC，查询路况等</br>||\n"
                    "||没有了|\n"
                    "|感谢您的来电，祝您生活愉快，<br>接下来请对本次服务做出评价，非常满意请按1，满意请按2，不满意</br>||", unsafe_allow_html = True)

    # ===============
    # API 接口文档
    # ===============
    st.header("♟ API 接口文档 ♟")
    if st.checkbox("点击查看 接口文档"):
        st.markdown("见 **12368司法服务热线**")

    # ===============
    # 定制需求
    # ===============
    st.header("♟ 定制需求 ♟")
    if st.checkbox("点击查看 定制需求"):
        st.write("客服大脑能力支持场景定制化")

if __name__ == '__main__':
    etc()