import streamlit as st
import pandas as pd

def judge_mrc():
    st.title("司法问答")

    # ===============
    # 概述
    # ===============
    st.header("♟ 概述 ♟")
    st.write("司法问答是一种，通过给定司法资料，和自定发起问题，期望获取资料所描述的对应答案的一种能力\n")

    # ===============
    # 样例体验
    # ===============
    st.header("♟ 样例体验 ♟")

    default_text = "本院经审理认定事实如下：被告刘x4承包经营原告的经营管理工作，\n"\
                   "双方于2017年12月1日签订《承包协议》，\n"\
                   "约定承包期间自2017年12月1日至2018年11月30日止；\n"\
                   "被告刘x4负责汶上分公司经营管理工作，\n"\
                   "公平、公正的处理一切商务事故，\n"\
                   "如果违规操作出现商务事故费用由被告刘x4承担；\n"\
                   "被告刘x4不得私自挪用公款，\n"\
                   "一经发现，\n"\
                   "除追回挪用公款外将给予被告刘x4挪用金额10%30%的处罚；\n"\
                   "被告刘x4将每日所收的代收款项及运费及时存入原告指定的账户；\n"\
                   "双方还约定了其他事项。\n"\
                   "2018年3月10日经原告与被告刘x4结算，\n"\
                   "被告刘x4向原告出具欠条一张，\n"\
                   "称其私自截留货款81386元，\n"\
                   "承诺于2018年4月10日前还清，\n"\
                   "如逾期被告刘x4自愿承担违约金10000元，\n"\
                   "并按每月2%支付利息。\n"\
                   "被告王x5作为连带责任保证人在欠条上签字捺印。\n"\
                   "2018年5月30日原告诉至本院，\n"\
                   "形成本案诉讼。\n"\
                   "另查明，\n"\
                   "2018年5月18日原告因本案曾向济宁市任城区人民法院提起诉讼，\n"\
                   "同日，\n"\
                   "该院以对该案无管辖权为由作出不予受理的裁定"
    default_query = "谁是被告刘x4欠款的保证人"
    default_answer = "王x5"

    if st.checkbox("🍄 点击查看文本"):
        st.markdown("**文书**")
        st.markdown("```" + default_text + "```")
        st.write("\n")
        st.markdown("**问题**")
        st.markdown("```" + default_query + "```")

    if st.button("解析"):
        st.success("解析完成")
        st.markdown("```" + default_answer + "```")

    # ===============
    # API 接口文档
    # ===============
    st.header("♟ API 接口文档 ♟")
    if st.checkbox("接口文档"):
        st.write("未完成\n")

    # ===============
    # 定制需求
    # ===============
    st.header("♟ 定制需求 ♟")
    if st.checkbox("定制需求"):
        st.write("该能力持续优化中\n")
        st.write("同时也支持场景定制化")

if __name__ == "__main__":
    judge_mrc()