import streamlit as st
import pandas as pd

def etc():
    # ===============
    # 概述
    # ===============
    st.header("♟ 概述 ♟")
    st.markdown(">**ETC销售**")
    st.markdown(">是一个简单的机器人ETC销售场景")

    # ===============
    # 样例体验
    # ===============
    st.header("♟ 样例体验 ♟")

    st.markdown(">以下样例展示了 **下城区12368司法服务** 的 **案件查询流程**")


    default_samples = ["轻松出行，畅通无忧。新型推出ETC轻松办理便民服务，您是否有办理需求",
                       "",
                       "您好，ETC指的是电子不停车收费系统，是指车辆在通过收费站时通过车上安装的ETC车载系统与收费站质检微波通讯，进行车辆识别，再联合网络和银行进行自动扣费的一种新型收费模式",
                       "",
                       "您好，请问您查询的是那条道路，如五常大道",
                       "",
                       "当前五常大道的路况为轻微拥堵请问您什么其他要求，例如办理ETC，查询路况等",
                       "",
                       "您好，ETC的优点在于可以为您节省收费站的排队时间，节省费用，车辆减少起步、刹车频率，降低磨损、油耗、绿色低碳，车辆通行收费站不停车，可降低噪声和尾气排放，减少污染",
                       "",
                       "感谢您的来电，祝您生活愉快，接下来请对本次服务做出评价，非常满意请按1，满意请按2，不满意请按3"
                       ]

    default_answer = ["",
                       "什么是ETC",
                       "",
                       "查一下路况",
                       "",
                       "五常大道",
                       "",
                       "ETC有什么用",
                       "",
                       "没有了",
                       ""]

    default_samples_2 = ["轻松出行，畅通无忧。新型推出ETC轻松办理便民服务，您是否有办理需求",
                         "",
                         "请问您查询的日期是什么时候，您可以说2020年1月",
                         "",
                         "查询到您共有1处罚记录请问您什么其他要求，例如办理ETC，查询路况等",
                         "",
                         "您好，你可前往营业大厅，或者拨打02596777进行在线办理请问您什么其他要求，例如办理ETC，查询路况等",
                         "感谢您的来电，祝您生活愉快，接下来请对本次服务做出评价，非常满意请按1，满意请按2，不满意"
                         ]

    default_answer_2 = ["",
                        "查一下违规记录",
                        "",
                        "2020年1月",
                        "",
                        "我想办理ETC",
                        "",
                        "没有了"]

    if st.checkbox("🍄 点击查看样例对话 1"):
        chat1 = dict(User = default_samples,
                     Bot = default_answer)
        st.table(chat1)

    if st.checkbox("🍄 点击查看样例对话 2"):
        chat2 = dict(Bot=default_samples_2,
                     User=default_answer_2)
        st.table(chat2)

    # ===============
    # API 接口文档
    # ===============
    st.header("♟ API 接口文档 ♟")
    if st.checkbox("接口文档"):
        st.markdown("见 **12368司法服务热线**")

    # ===============
    # 定制需求
    # ===============
    st.header("♟ 定制需求 ♟")
    if st.checkbox("定制需求"):
        st.write("该能力持续优化中\n")
        st.write("同时也支持场景定制化")

if __name__ == '__main__':
    etc()